# **Ejercicios de pair programming Módulo 2 Sprint 1**
## **Pandas: Lección 1**
### **Dataframes y Series**

---

In [1]:
import numpy as np
import pandas as pd

1. ¿Qué diferencia hay entre una Serie y un DataFrame?

`Una serie consta de una única columna o fila mientras que un DataFrame consta de dos o más.`

2. Momento de trabajar con Series. Contestad a las siguientes preguntas:
- Crea dos listas:
    - Una que se llame "valores" que tenga 7 números aleatorios.
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [2]:
array_valores = np.random.randint(1, 10, (7))
valores = list(array_valores)
valores

[5, 7, 7, 3, 7, 4, 7]

In [3]:
indices = ["Lunes", "Martes", "Miércoles", "Jueves", "Viernes", "Sábado", "Domingo"]

   - A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [4]:
serie = pd.Series(valores, index = indices)
serie

Lunes        5
Martes       7
Miércoles    7
Jueves       3
Viernes      7
Sábado       4
Domingo      7
dtype: int64

- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método aquí.

In [5]:
#Nuestra primera idea ha sido realizar el ejercicio de este modo que es más sencillo pero que no usa el bucle for como se nos pide. Decidimos resolverlo de los dos modos.

diccionario = dict(zip(indices, valores))

diccionario

{'Lunes': 5,
 'Martes': 7,
 'Miércoles': 7,
 'Jueves': 3,
 'Viernes': 7,
 'Sábado': 4,
 'Domingo': 7}

In [6]:
diccionario2 = {}

for x,y in zip(indices, valores):
    diccionario2.update({x:y})

diccionario2

{'Lunes': 5,
 'Martes': 7,
 'Miércoles': 7,
 'Jueves': 3,
 'Viernes': 7,
 'Sábado': 4,
 'Domingo': 7}

- Crea una Serie con el diccionario creado en el punto anterior.

In [7]:
semana = pd.Series(diccionario2)
semana

Lunes        5
Martes       7
Miércoles    7
Jueves       3
Viernes      7
Sábado       4
Domingo      7
dtype: int64

- ¿Qué forma tiene esta última Serie?

In [8]:
semana.shape

(7,)

- ¿Qué tipo de datos tiene?

In [9]:
semana.dtype

dtype('int64')

- ¿Qué tamaño tiene?

In [10]:
semana.size

7

- ¿Cuáles son los índices de la Serie?

In [11]:
semana.index

Index(['Lunes', 'Martes', 'Miércoles', 'Jueves', 'Viernes', 'Sábado',
       'Domingo'],
      dtype='object')

- ¿Y los values?

In [12]:
semana.values

array([5, 7, 7, 3, 7, 4, 7])

- Extraed el valor para el índice "lunes".

In [13]:
semana["Lunes"]

5

- Extraed el valor para el índice "lunes", "martes" y "miércoles".

In [14]:
semana["Lunes":"Miércoles"]

Lunes        5
Martes       7
Miércoles    7
dtype: int64

- Extraed el valor para el índice "lunes" y "domingo".

In [15]:
semana[["Lunes", "Domingo"]]

Lunes      5
Domingo    7
dtype: int64

3. Es el turno de los DataFrames:

- Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [16]:
array = np.random.randint(1, 10, (4,3))
array

array([[9, 8, 7],
       [1, 1, 3],
       [1, 4, 9],
       [1, 1, 8]])

- Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [17]:
dataframe = pd.DataFrame(array, columns = ["España", "Francia", "Italia"])
dataframe

   España  Francia  Italia
0       9        8       7
1       1        1       3
2       1        4       9
3       1        1       8

- Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

 ```python
        df = pd.read_csv("medallas.csv", index_col=["País"])
        
📌 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [18]:
df = pd.read_csv("data/medallas.csv", index_col=["País"])

In [19]:
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

- Usando el `loc` extraed todas las columnas de la fila de Tailandia.

In [20]:
df.loc[["Tailandia"], :]

           Unnamed: 0  Oro  Plata  Bronce
País
Tailandia           7  132    175     278

- Usando el `loc` extraed todas las columnas de China e Irán.

In [21]:
df.loc[["China Taipéi", "Irán"], :]

              Unnamed: 0  Oro  Plata  Bronce
País
China Taipéi           9   99    144     276
Irán                   4  179    181     197

- Usando el `loc` extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [22]:
df.loc[["China Taipéi", "Irán"], "Oro":"Bronce"]

              Oro  Plata  Bronce
País
China Taipéi   99    144     276
Irán          179    181     197

- Usando el `iloc` extraed la información de la India. Devolved todas las columnas.

In [23]:
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [24]:
df.iloc[[5], :]

       Unnamed: 0  Oro  Plata  Bronce
País
India           6  154    202     315

- Usando el `iloc` extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [25]:
df.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

- Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [26]:
df.iloc[1::2, 1:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

- Contestad a las siguientes preguntas:
    - ¿Qué país consiguió más de 200 medallas de oro?
    - ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?
    - ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [27]:
df.iloc[(list(df["Oro"] > 200)), [1]]

                Oro
País
China          1473
Japón          1032
Corea del Sur   745

- Como vemos hay una columna que se llama `Unnamed: 0` que no nos interesa. Eliminad esa columna.

In [28]:
df = df.drop(columns=['Unnamed: 0'])

In [29]:
df

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [30]:
df = df.assign(Total = df['Oro'] + df['Plata'] + df['Bronce'])

In [31]:
df

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446

In [32]:
df['Total2'] = df['Oro'] + df['Plata'] + df['Bronce']

In [33]:
df

                  Oro  Plata  Bronce  Total  Total2
País
China            1473    994     720   3187    3187
Japón            1032   1037     985   3054    3054
Corea del Sur     745    663     827   2235    2235
Irán              179    181     197    557     557
Kazajistán        155    158     224    537     537
India             154    202     315    671     671
Tailandia         132    175     278    585     585
Indonesia         112    131     240    483     483
China Taipéi       99    144     276    519     519
Corea del Norte    91    120     235    446     446